code-review/NRB_3471_3546/База_Стало/Catalogs/РеестрВнешнихОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РеестрВнешнихОтчетов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отчет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступПользователей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВремяЗапуска</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПравилоРаботает</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Окончание</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Catalogs/РеестрВнешнихОтчетов/Forms/ФормаСписка/Ext/Form/Module.bsl
//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПараметрыДляДополнительныхСписков();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Изменен реестр внешних отчетов" Тогда
		ТекДанные = Элементы.Список.ТекущиеДанные;
		Если ТекДанные <> Неопределено Тогда
			Если ТекДанные.Ссылка = Параметр Тогда
				ОбновитьПараметрыДляДополнительныхСписков();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//#КонецОбласти 

//#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	Отказ = ФлагОтказа;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТекДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	Если НЕ Элементы.Список.ТолькоПросмотр Тогда
		Меню = Новый СписокЗначений;
		Меню.Добавить(Ложь,"Редактировать элемент справочника?");
		Меню.Добавить(Истина,"Запустить отчет?");
		
		ЧтоВыбрали = ВыбратьИзМеню(Меню,Элемент);
		Если НЕ ЧтоВыбрали = Неопределено Тогда
			Если ЧтоВыбрали.Значение Тогда
				ЗапускОтчетов(ТекДанные.Ссылка);
				ФлагОтказа = Истина;
			Иначе
				ФлагОтказа = Ложь;
			КонецЕсли;
		КонецЕсли; 
	Иначе
		ЗапускОтчетов(ТекДанные.Ссылка);
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ОбновитьПараметрыДляДополнительныхСписков();
			
КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьПараметрыДляДополнительныхСписков()
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		УстановитьПараметрыДляДополнительныхСписков();
	Иначе
		УстановитьПараметрыДляДополнительныхСписков(ТекДанные.Ссылка);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыДляДополнительныхСписков(Значение = Неопределено)
	
	Если Значение = Неопределено Тогда
		Значение = ПредопределенноеЗначение("Справочник.РеестрВнешнихОтчетов.ПустаяСсылка");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДоступПользователей	, "Ссылка", Значение);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ВремяЗапуска			, "Ссылка", Значение);

КонецПроцедуры

&НаКлиенте
Процедура ЗапускОтчетов(ОтчетДляЗапуска)
	
	ИмяФайлаОтчета	= ПолучитьИмяВременногоФайла(".epf");
	ХранилищеВнешнегоОтчета(ОтчетДляЗапуска).Записать(ИмяФайлаОтчета);

	АдресХранилища	= "";
	Результат		= ПоместитьФайл(АдресХранилища, ИмяФайлаОтчета,,Ложь);
	ИмяОтчета		= ПодключеннаяВнешняяОбработка(АдресХранилища);
	ОткрытьФорму("ВнешняяОбработка."+ИмяОтчета+".Форма");

КонецПроцедуры

&НаСервереБезКонтекста
Функция ХранилищеВнешнегоОтчета(ОтчетДляЗапуска)
	
	Возврат ОтчетДляЗапуска.ПолучитьОбъект().Отчет.Получить();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПодключеннаяВнешняяОбработка(Адрес)
	
	Возврат ВнешниеОбработки.Подключить(Адрес);
	
КонецФункции

//#КонецОбласти
